import type { Currency, CurrencyResult } from './typings';
import { normalizeCurrencyString } from './utils';


const regexps: [Currency, RegExp][]  = [
    ['USD', /(((\$|usd)\s?)((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?)(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?|((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?(\s?(\$|дол|dol|баксов|бакса|usd))))/i,],
    ['EUR', /(((€|eur)\s?)((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?)(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?|((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?(\s?(€|евро|эвро|eur|ewro))))/i,],
    ['RUB', /(((₽|rub)\s?)((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?)(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?|((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?(\s?(₽|руб|rub|р))))/i,],
    ['BYN', /(((Br|BYN)\s?)((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?)(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?|((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?(\s?(Br|белорусских рублей|белорусских|BYN))))/i,],
    ['KZT', /(((₸|KZT)\s?)((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?)(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?|((\d+\s\d+\s\d+|\d+\s\d+|\d+)((,|\.)\d+)?(\s?(миллион(а|ов)?|миллиард(а|ов)?|млн|млрд|тысячи|тыс|тысяч|сотен|сотни|k|к)\.?\s?)?(\s?(тенге|тнг))))/i,],
    
];

export const parse = (message: string): CurrencyResult[] => {
    const result: CurrencyResult[] = [];

    for (const [currency, regexp] of regexps) {
        if (regexp.test(message)) {
            const matches = message.match(regexp);
            if (!matches) {
                continue;
            }

            const [rawValue] = matches;

            result.push({
                currency,
                value: normalizeCurrencyString(rawValue),
            });
        }
    }

    return result;
}